/* IFURLHandleResultBadGateway description */
"bad gateway" = "bad gateway";

/* IFURLHandleResultBadRequest description */
"bad request" = "bad request";

/* IFURLHandleResultBadURLError description */
"bad URL" = "bad URL";

/* IFURLHandleResultCantConnectToHostError description */
"can't connect to host" = "can't connect to host";

/* IFURLHandleResultCantLoadFromNetworkError description */
"can't load from network" = "can't load from network";

/* IFURLHandleResultCancelled description */
"cancelled" = "cancelled";

/* IFURLHandleResultConflict description */
"conflict" = "conflict";

/* IFURLHandleResultDNSLookupError description */
"DNS lookup error" = "DNS lookup error";

/* IFURLHandleResultReadStreamCreateError description */
"error creating read stream" = "error creating read stream";

/* IFURLHandleResultReadStreamOpenError description */
"error opening read stream" = "error opening read stream";

/* IFURLHandleResultReadStreamError description */
"error reading stream" = "error reading stream";

/* IFURLHandleResultRequestCreateError description */
"error requesting create" = "error requesting create";

/* IFURLHandleResultReadStreamSetClientError description */
"error setting client for read stream" = "error setting client for read stream";

/* IFURLHandleResultExpectationFailed description */
"expectation failed" = "expectation failed";

/* IFURLHandleResultForbidden description */
"forbidden" = "forbidden";

/* IFURLHandleResultGatewayTimeOut description */
"gateway time out" = "gateway time out";

/* IFURLHandleResultGone description */
"gone" = "gone";

/* IFURLHandleResultHTTPRedirectionLoopError description */
"HTTP redirection loop error" = "HTTP redirection loop error";

/* IFURLHandleResultHTTPVersionNotSupported description */
"HTTP version not supported" = "HTTP version not supported";

/* IFURLHandleResultInternalServerError description */
"internal server error" = "internal server error";

/* IFURLHandleResultLengthRequired description */
"length required" = "length required";

/* IFURLHandleResultNetworkConnectionLostError description */
"lost network connection" = "lost network connection";

/* IFURLHandleResultNotAcceptable description */
"not acceptable" = "not acceptable";

/* IFURLHandleResultMethodNotAllowed description */
"not allowed" = "not allowed";

/* IFURLHandleResultNotFound description */
"not found" = "not found";

/* IFURLHandleResultNotImplemented description */
"not implemented" = "not implemented";

/* IFURLHandleResultPaymentRequired description */
"payment required" = "payment required";

/* IFURLHandleResultProxyAuthenticationRequired description */
"proxy authentication required" = "proxy authentication required";

/* IFURLHandleResultRequestEntityTooLarge description */
"request entity too large" = "request entity too large";

/* IFURLHandleResultRequestRangeNotSatisfiable description */
"request range not satisfiable" = "request range not satisfiable";

/* IFURLHandleResultRequestTimeOut description */
"request time out" = "request time out";

/* IFURLHandleResultRequestURITooLarge description */
"request URI too large" = "request URI too large";

/* IFURLHandleResultResourceUnavailableError description */
"resource unvailable" = "resource unvailable";

/* IFURLHandleResultServiceUnavailable description */
"service unavailable" = "service unavailable";

/* IFURLHandleResultTimedOut description */
"time out" = "time out";

/* IFURLHandleResultUnauthorized description */
"unauthorized" = "unauthorized";

/* IFURLHandleResultUnsupportedMediaType description */
"unsupported media type" = "unsupported media type";

/* IFURLHandleResultUnsupportedURLHandleError description */
"unsupported URL handle" = "unsupported URL handle";

/* IFNonHTMLContentNotSupportedError description */
"non-HTML content not currently supported" = "non-HTML content not currently supported";

/* IFFileDownloadNotSupportedError description */
"file download not currently supported" = "file download not currently supported";